Andydingbing/SPC5/include/RegDef.h
#ifndef __REG_DEF_H__
#define __REG_DEF_H__

#define CONFIG_FILE_PATH "config.ini"

#include "stdint.h"

// 1 address
// union reg0x....{
//      uint32_t u32;
// 	struct reg_t{
//          ...;
//          ...;
// 	} r;
// };

#define REG_DEF_S(addr)	\
    union reg##addr {	\
        uint32_t u32;	\
        struct reg_t {

#define REG_DEF_E       \
        } r;            \
    };

#define REG_DECLARE(ns,addr) union ns::reg##addr ns##r##addr = { 0 };
#define REG(ns,addr) ns##r##addr.r
#define REG_U32(ns,addr) ns##r##addr.u32
#define REG_CLEAR(ns,addr) ns##r##addr.u32 = 0;

#define K7_OP(ns,addr) K7OP(ns,addr,op)
#define K7_OP_DELAY(ns,addr,time) K7OP_DELAY(ns,addr,op,time)
#define K7_WAIT_IDLE(ns,addr,flag,times) K7WAIT_IDLE(ns,addr,busy,flag,times)
#define S6_OP(ns,addr) S6OP(ns,addr,op)
#define S6_WAIT_FIFO_EMPTY(ns,addr,flag,times) S6WAIT_FIFO_EMPTY(ns,addr,fifo_prog_full,flag,times)

#ifdef _DEBUG
#define K7_ASSERT()                                 \
    if (NULL == m_pK7) {                            \
        Log->SetLastError("device:k7 disconnect");  \
        return -1;                                  \
    }

#define S6_ASSERT()                                 \
    if (NULL == m_pS6) {                            \
        Log->SetLastError("device:s6 disconnect");  \
        return -1;                                  \
    }
#else
#define K7_ASSERT()
#define S6_ASSERT()
#endif

#define K7_W(ns,addr)																			\
    do {                                                                                    \
        K7_ASSERT();                                                                        \
        int32_t iRes = 0;                                                                   \
        if ((iRes = m_pK7->W32(IPCIDev::AS_BAR0,uint16_t(addr<<2),REG_U32(ns,addr)))) {     \
            Log->SetLastError("%s:%s line%d",__FILE__,__FUNCTION__,__LINE__);               \
            Log->trace("%s w %#06x:%#010x ¨w\n",m_pK7->GetDevName(),addr,REG_U32(ns,addr)); \
            return -1;                                                                      \
        }                                                                                   \
        Log->AddRegList(iRes,m_pK7->GetDevName(),addr,REG_U32(ns,addr));                    \
    }while (0);

#define K7_R(ns,addr)																						\
    do {												\
        K7_ASSERT();											\
        int32_t iRes = 0;										\
        if ((iRes = m_pK7->R32(IPCIDev::AS_BAR0,uint16_t(addr<<2),&REG_U32(ns,addr)))) {           	\
            Log->SetLastError("%s:%s line%d",__FILE__,__FUNCTION__,__LINE__);				\
            Log->trace("%s r  %#06x:\t\t\t\t%#010x ¨w\n",m_pK7->GetDevName(),addr,REG_U32(ns,addr));	\
            return -1;											\
        }												\
        Log->AddRegList(iRes,m_pK7->GetDevName(),addr,-1,REG_U32(ns,addr));                             \
    }while (0);

#define K7OP(ns,addr,bit)	\
    do {                        \
        REG(ns,addr).bit = 0;	\
        K7_W(ns,addr);		\
        REG(ns,addr).bit = 1;	\
        K7_W(ns,addr);		\
        K7_W(ns,addr);		\
        K7_W(ns,addr);		\
        K7_W(ns,addr);		\
        K7_W(ns,addr);		\
        K7_W(ns,addr);		\
        K7_W(ns,addr);		\
        K7_W(ns,addr);		\
        REG(ns,addr).bit = 0;	\
        K7_W(ns,addr);		\
    }while (0);

#define K7OP_DELAY(ns,addr,bit,time)    \
    do {                                \
        if (time)   Sleep(time);        \
        REG(ns,addr).bit = 0;           \
        K7_W(ns,addr);                  \
        if (time)   Sleep(time);        \
        REG(ns,addr).bit = 1;           \
        K7_W(ns,addr);                  \
        if (time)   Sleep(time);        \
        REG(ns,addr).bit = 0;           \
        K7_W(ns,addr);                  \
    }while (0);

#define K7WAIT_IDLE(ns,addr,bit,flag,times)				\
    do {								\
        bool idle = false;						\
        K7_R(ns,addr);							\
        for (int32_t i = 0;i < times;i ++) {				\
            if (flag == REG(ns,addr).bit) {				\
                idle = true;						\
                break;							\
            }								\
            K7_R(ns,addr);						\
        }                                                               \
        if (!idle) {							\
            Log->SetLastError("reg%#06x wait idle timeout",addr);	\
            return -1;							\
        }								\
    } while (0);

#define S6WAIT_FIFO_EMPTY(ns,addr,bit,flag,times)			\
    do {                        					\
        bool full = true;						\
        RFU_S6_R(addr);							\
        for (int32_t i = 0;i < times;i ++) {				\
            if (flag != REG(ns,addr).bit) {				\
                full = false;						\
                break;							\
            }								\
        }								\
        if (full) {							\
            Log->SetLastError("reg%#06x wait fifo empty timeout",addr);	\
            return -1;							\
        }								\
    } while (0);

#define S6OP(ns,addr,bit)       \
    do {			\
        REG(ns,addr).bit = 0;	\
        S6_W(ns,addr);          \
        REG(ns,addr).bit = 1;	\
        S6_W(ns,addr);		\
        S6_W(ns,addr);		\
        S6_W(ns,addr);		\
        S6_W(ns,addr);		\
        S6_W(ns,addr);		\
        S6_W(ns,addr);		\
        S6_W(ns,addr);		\
        S6_W(ns,addr);		\
        REG(ns,addr).bit = 0;	\
        S6_W(ns,addr);		\
    }while (0);

#define S6_W(ns,addr)                                                                       \
    do {                                                                                    \
        S6_ASSERT();                                                                        \
        int32_t iRes = 0;                                                                   \
        if ((iRes = m_pS6->W32(IPCIDev::AS_BAR0,uint16_t(addr <<2),REG_U32(ns,addr)))) {    \
            Log->SetLastError("%s:%s line%d",__FILE__,__FUNCTION__,__LINE__);               \
            Log->trace("%s w %#06x:%#010x ¨w\n",m_pS6->GetDevName(),addr,REG_U32(ns,addr)); \
            return -1;                                                                      \
        }                                                                                   \
        Log->AddRegList(iRes,m_pS6->GetDevName(),addr,REG_U32(ns,addr));                    \
    }while (0);

#define S6_R(ns,addr)											\
    do {                                                                                                \
        S6_ASSERT();											\
        int32_t iRes = 0;										\
        if ((iRes = m_pS6->R32(IPCIDev::AS_BAR0,uint16_t(addr <<2),&REG_U32(ns,addr)))) {               \
            Log->SetLastError("%s:%s line%d",__FILE__,__FUNCTION__,__LINE__);				\
            Log->trace("%s r  %#06x:\t\t\t\t%#010x ¨w\n",m_pS6->GetDevName(),addr,REG_U32(ns,addr));    \
            return -1;											\
        }												\
        Log->AddRegList(iRes,m_pS6->GetDevName(),addr,-1,REG_U32(ns,addr));				\
    }while (0);

