Andydingbing/SPC5/include/RegDef.h
#define RFU_K7_REG_DECLARE(addr) REG_DECLARE(ns_reg_rfu_k7,addr)
#define RFU_K7_REG(addr) REG(ns_reg_rfu_k7,addr)
#define RFU_K7_REG_U32(addr) REG_U32(ns_reg_rfu_k7,addr)
#define RFU_K7_REG_CLEAR(addr) REG_CLEAR(ns_reg_rfu_k7,addr)
#define RFU_K7OP(addr,bit) K7OP(ns_reg_rfu_k7,addr,bit)
#define RFU_K7_OP(addr) K7_OP(ns_reg_rfu_k7,addr)
#define RFU_K7_OP_DELAY(addr,time) K7_OP_DELAY(ns_reg_rfu_k7,addr,time)
#define RFU_K7_WAIT_IDLE(addr,flag,times) K7_WAIT_IDLE(ns_reg_rfu_k7,addr,flag,times)
#define RFU_K7_W(addr) K7_W(ns_reg_rfu_k7,addr)
#define RFU_K7_R(addr) K7_R(ns_reg_rfu_k7,addr)
#define RFU_S6_REG_DECLARE(addr) REG_DECLARE(ns_reg_rfu_s6,addr)
#define RFU_S6_REG(addr) REG(ns_reg_rfu_s6,addr)
#define RFU_S6_REG_U32(addr) REG_U32(ns_reg_rfu_s6,addr)
#define RFU_S6_REG_CLEAR(addr) REG_CLEAR(ns_reg_rfu_s6,addr)
#define RFU_S6_OP(addr) S6_OP(ns_reg_rfu_s6,addr)
#define RFU_S6_WAIT_FIFO_EMPTY(addr,flag,times) S6_WAIT_FIFO_EMPTY(ns_reg_rfu_s6,addr,flag,times)
#define RFU_S6_W(addr) S6_W(ns_reg_rfu_s6,addr)
#define RFU_S6_R(addr) S6_R(ns_reg_rfu_s6,addr)
#define CXU_S6_REG_DECLARE(addr) REG_DECLARE(ns_reg_cxu_s6,addr)
#define CXU_S6_REG(addr) REG(ns_reg_cxu_s6,addr)
#define CXU_S6_REG_U32(addr) REG_U32(ns_reg_cxu_s6,addr)
#define CXU_S6_REG_CLEAR(addr) REG_CLEAR(ns_reg_cxu_s6,addr)
#define CXU_S6_OP(addr) S6_OP(ns_reg_cxu_s6,addr)
#define CXU_S6_W(addr) S6_W(ns_reg_cxu_s6,addr)
#define CXU_S6_R(addr) S6_R(ns_reg_cxu_s6,addr)


// 2 addresses
// struct reg0x....0x...._t {
//      uint32_t addr[4];
//      union reg {
//          uint32_t u32;
//          struct r_t {
//              ...;
//              ...;
//          } r;
//      };
//      union reg data;
// };

#define REG_DEF_S_2(addr0,addr1)    \
    struct reg##addr0##addr1##_t {  \
        uint32_t addr[4];           \
        union reg {                 \
            uint32_t u32;           \
            struct r_t {

#define REG_DEF_E_2                 \
            } r;                    \
        };                          \
        union reg data;             \
    };

#define REG_DECLARE_2(ns,addr0,addr1) struct ns::reg##addr0##addr1##_t ns##r##addr0##addr1 = {{addr1,addr0,addr1,addr0},0};
#define REG_2(ns,addr0,addr1) ns##r##addr0##addr1.data.r
#define REG_U32_2(ns,addr0,addr1) ns##r##addr0##addr1.data.u32
#define REG_CLEAR_2(ns,addr0,addr1) ns##r##addr0##addr1.data.u32 = 0;

#define K7_OP_2(ns,addr0,addr1) K7OP_2(ns,addr0,addr1,op)
#define K7_OP_DELAY_2(ns,addr0,addr1,time) K7OP_DELAY_2(ns,addr0,addr1,op,time)
#define K7_WAIT_IDLE_2(ns,addr0,addr1,flag,times) K7WAIT_IDLE_2(ns,addr0,addr1,busy,flag,times)
#define S6_WAIT_FIFO_EMPTY_2(ns,addr0,addr1,flag,times) S6WAIT_FIFO_EMPTY_2(ns,addr0,addr1,fifo_prog_full,flag,times)

#define K7_W_2(ns,addr0,addr1)										\
    do {                                                                                                \
        K7_ASSERT();											\
        int32_t iRes = 0;										\
        uint32_t uiAddr = ns##r##addr0##addr1.addr[GetRfIdx()];						\
        if ((iRes = m_pK7->W32(IPCIDev::AS_BAR0,uiAddr<<2,REG_U32_2(ns,addr0,addr1)))) {		\
            Log->SetLastError("%s:%s line%d",__FILE__,__FUNCTION__,__LINE__);				\
            Log->trace("%s w %#06x:%#010x ¨w\n",m_pK7->GetDevName(),uiAddr,REG_U32_2(ns,addr0,addr1));  \
            return -1;											\
        }												\
        Log->AddRegList(iRes,m_pK7->GetDevName(),uiAddr,REG_U32_2(ns,addr0,addr1));			\
    }while (0);

#define K7_R_2(ns,addr0,addr1)											\
    do {													\
        K7_ASSERT();                                                                                            \
        int32_t iRes = 0;											\
        uint32_t uiAddr = ns##r##addr0##addr1.addr[GetRfIdx()];							\
        if ((iRes = m_pK7->R32(IPCIDev::AS_BAR0,uiAddr<<2,&REG_U32_2(ns,addr0,addr1)))) {			\
            Log->SetLastError("error in %s: func:%s line%d",__FILE__,__FUNCTION__,__LINE__);			\
            Log->trace("%s r  %#06x:\t\t\t\t%#010x ¨w\n",m_pK7->GetDevName(),uiAddr,REG_U32_2(ns,addr0,addr1)); \
            return -1;												\
        }													\
        Log->AddRegList(iRes,m_pK7->GetDevName(),uiAddr,-1,REG_U32_2(ns,addr0,addr1));				\
    }while (0);

#define K7OP_2(ns,addr0,addr1,bit)	\
    do {				\
        REG_2(ns,addr0,addr1).bit = 0;	\
        K7_W_2(ns,addr0,addr1);		\
        REG_2(ns,addr0,addr1).bit = 1;	\
        K7_W_2(ns,addr0,addr1);		\
        K7_W_2(ns,addr0,addr1);		\
        K7_W_2(ns,addr0,addr1);		\
        K7_W_2(ns,addr0,addr1);		\
        K7_W_2(ns,addr0,addr1);		\
        K7_W_2(ns,addr0,addr1);		\
        K7_W_2(ns,addr0,addr1);		\
        K7_W_2(ns,addr0,addr1);		\
        REG_2(ns,addr0,addr1).bit = 0;	\
        K7_W_2(ns,addr0,addr1);		\
    } while (0);

#define K7OP_DELAY_2(ns,addr0,addr1,bit,time)   \
    do {                                        \
        if (time) Sleep(time);                  \
        REG_2(ns,addr0,addr1).bit = 0;          \
        K7_W_2(ns,addr0,addr1);                 \
        if (time) Sleep(time);                  \
        REG_2(ns,addr0,addr1).bit = 1;          \
        K7_W_2(ns,addr0,addr1);                 \
        if (time) Sleep(time);                  \
        REG_2(ns,addr0,addr1).bit = 0;          \
        K7_W_2(ns,addr0,addr1);                 \
    } while (0);

#define K7WAIT_IDLE_2(ns,addr0,addr1,bit,flag,times)                \
    do {                                                            \
        bool idle = false;                                          \
        uint32_t uiAddr = ns##r##addr0##addr1.addr[GetRfIdx()];     \
        K7_R_2(ns,addr0,addr1);                                     \
        for (int32_t i = 0;i < times;i ++) {                        \
            if (flag == REG_2(ns,addr0,addr1).bit) {                \
                idle = true;                                        \
                break;                                              \
            }                                                       \
            K7_R_2(ns,addr0,addr1);                                 \
        }                                                           \
        if (!idle) {                                                \
            Log->SetLastError("reg%#06x wait idle timeout",uiAddr); \
            return -1;                                              \
        }                                                           \
    } while (0);

#define S6WAIT_FIFO_EMPTY_2(ns,addr0,addr1,bit,flag,times)                  \
    do  {                                                                   \
        bool full = true;                                                   \
        uint32_t uiAddr = ns##r##addr0##addr1.addr[GetRfIdx()/2];           \
        RFU_S6_R_2(addr0,addr1);                                            \
        for (int32_t i = 0;i < times;i ++) {                                \
            if (flag != REG_2(ns,addr0,addr1).bit) {                        \
                full = false;                                               \
                break;                                                      \
            }                                                               \
        }                                                                   \
        if (full) {                                                         \
            Log->SetLastError("reg %#06x wait fifo empty timeout",uiAddr);  \
            return -1;                                                      \
        }                                                                   \
    } while (0);

