Andydingbing/SPC5/include/RegDef.h
#define S6_W_2(ns,addr0,addr1)										\
    do {                                                                                                \
        S6_ASSERT();											\
        int32_t iRes = 0;                                                                               \
        uint32_t uiAddr = ns##r##addr0##addr1.addr[GetRfIdx()/2];                                       \
        if ((iRes = m_pS6->W32(IPCIDev::AS_BAR0,uiAddr<<2,REG_U32_2(ns,addr0,addr1)))) {                \
            Log->SetLastError("%s:%s line%d",__FILE__,__FUNCTION__,__LINE__);                           \
            Log->trace("%s w %#06x:%#010x ¨w\n",m_pS6->GetDevName(),uiAddr,REG_U32_2(ns,addr0,addr1));  \
            return -1;											\
        }                                                                                               \
        Log->AddRegList(iRes,m_pS6->GetDevName(),uiAddr,REG_U32_2(ns,addr0,addr1));			\
    }while (0);

#define S6_R_2(ns,addr0,addr1)                                                                                 	\
    do {													\
        S6_ASSERT();												\
        int32_t iRes = 0;                                                                                       \
        uint32_t uiAddr = ns##r##addr0##addr1.addr[GetRfIdx()/2];						\
        if ((iRes = m_pS6->R32(IPCIDev::AS_BAR0,uiAddr<<2,&REG_U32_2(ns,addr0,addr1)))) {                       \
            Log->SetLastError("%s:%s line%d",__FILE__,__FUNCTION__,__LINE__);                                   \
            Log->trace("%s r  %#06x:\t\t\t\t%#010x ¨w\n",m_pS6->GetDevName(),uiAddr,REG_U32_2(ns,addr0,addr1)); \
            return -1;                                                                                          \
        }													\
        Log->AddRegList(iRes,m_pS6->GetDevName(),uiAddr,-1,REG_U32_2(ns,addr0,addr1));                          \
    }while (0);

#define RFU_K7_REG_DECLARE_2(addr0,addr1) REG_DECLARE_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7_REG_2(addr0,addr1) REG_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7_REG_U32_2(addr0,addr1) REG_U32_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7_REG_CLEAR_2(addr0,addr1) REG_CLEAR_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7OP_2(addr0,addr1,bit) K7OP_2(ns_reg_rfu_k7,addr0,addr1,bit)
#define RFU_K7_OP_2(addr0,addr1) K7_OP_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7_OP_DELAY_2(addr0,addr1,time) K7_OP_DELAY_2(ns_reg_rfu_k7,addr0,addr1,time)
#define RFU_K7_WAIT_IDLE_2(addr0,addr1,flag,times) K7_WAIT_IDLE_2(ns_reg_rfu_k7,addr0,addr1,flag,times)
#define RFU_K7_W_2(addr0,addr1) K7_W_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7_R_2(addr0,addr1) K7_R_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_S6_REG_DECLARE_2(addr0,addr1) REG_DECLARE_2(ns_reg_rfu_s6,addr0,addr1)
#define RFU_S6_REG_2(addr0,addr1) REG_2(ns_reg_rfu_s6,addr0,addr1)
#define RFU_S6_REG_U32_2(addr0,addr1) REG_U32_2(ns_reg_rfu_s6,addr0,addr1)
#define RFU_S6_WAIT_FIFO_EMPTY_2(addr0,addr1,flag,times) S6_WAIT_FIFO_EMPTY_2(ns_reg_rfu_s6,addr0,addr1,flag,times)
#define RFU_S6_W_2(addr0,addr1) S6_W_2(ns_reg_rfu_s6,addr0,addr1)
#define RFU_S6_R_2(addr0,addr1) S6_R_2(ns_reg_rfu_s6,addr0,addr1)

//register define

//rfu k7
namespace ns_reg_rfu_k7 {

REG_DEF_S(0x0000)
    unsigned op   : 1;	//dma reset
    unsigned rsv  : 7;
    unsigned ver  : 8;	//firmware ver
    unsigned cdw  : 4;
#define cdw_invalid 0
#define cdw_32      1
#define cdw_64      2
#define cdw_128     3
REG_DEF_E

REG_DEF_S(0x0001)
    unsigned fpga_wr_op   : 1;		//fpga dma write start
    unsigned rsv          : 6;
    unsigned dis_wr_int   : 1;		//disable fpga dma write interruption
    unsigned fpga_wr_done : 1;		//fpga dma write done
    unsigned rsv2         : 7;

    unsigned fpga_rd_op   : 1;		//fpga dma read start
    unsigned rsv3         : 6;
    unsigned dis_rd_int   : 1;		//disable fpga dma read interruption
    unsigned fpga_rd_done : 1;		//fpga dma read done
    unsigned rsv4         : 7;
REG_DEF_E

REG_DEF_S(0x0007)
    unsigned adr : 32;			//fpga dma read physical address
REG_DEF_E

REG_DEF_S(0x0008)
    unsigned tlp_size : 16;		//fpga dma read tlp size
REG_DEF_E

REG_DEF_S(0x0009)
    unsigned tlp_count : 20;		//fpga dma read tlp count
REG_DEF_E

REG_DEF_S(0x0014)
    unsigned samples : 32;		//fpga dma write total samples written
REG_DEF_E

REG_DEF_S(0x0016)
    unsigned data : 32;			//fpga dma write physical memory block index
REG_DEF_E

REG_DEF_S(0x0017)
    unsigned adr : 32;                  //fpga dma write physical memory block address
REG_DEF_E

REG_DEF_S(0x0020)
    unsigned dma_rd_timer : 32;		//fpga dma read timer
REG_DEF_E

REG_DEF_S(0x0021)
    unsigned dma_rd_counter : 32;	//fpga dma read counter
REG_DEF_E

REG_DEF_S(0x0025)
    unsigned data : 32;			//reserved
REG_DEF_E

REG_DEF_S(0x0028)
    unsigned addr : 29;			//fpga dma read/write begin address
    unsigned rsv  : 1;
    unsigned flag : 2;			//fpga dma read/write flag,//b00:fpga read	//b01:fpga write
REG_DEF_E

REG_DEF_S(0x002f)
    unsigned samples : 32;		//fpga dma read total samples
REG_DEF_E

REG_DEF_S(0x0035)
    unsigned op	   : 1;			//ad/da freq en
    unsigned rsv   : 1;
    unsigned ad_da : 1;			//ad/da select
REG_DEF_E

REG_DEF_S(0x0036)
    unsigned freq_frac : 8;		//ad/da freq frac,default da:491.52MHz,ad:368.64MHz
    unsigned freq_int  : 10;		//ad/da freq int             0x1eb34,	  0x17040
    unsigned rsv       : 14;
REG_DEF_E

REG_DEF_S_2(0x0061,0x2061)		//tx dc offset
    unsigned i : 16;
    unsigned q : 16;
REG_DEF_E_2

REG_DEF_S_2(0x0067,0x2067)		//tx amplitude balance
    unsigned i : 16;
    unsigned q : 16;
REG_DEF_E_2

REG_DEF_S_2(0x006a,0x206a)		//tx i phase rotate
    unsigned cos : 16;
    unsigned sin : 16;
REG_DEF_E_2

REG_DEF_S_2(0x0072,0x2072)		//tx baseband data source
    unsigned bb_tx_source : 3;		//b000:all 0  //b001:inter filter  //b010:all 1  //b011:dds single tone //b100:dds two tone  //b101:arb in ddr  //b110:ddr3
REG_DEF_E_2

REG_DEF_S_2(0x0079,0x2079)
    unsigned dds1_op : 1;		//dds1 freq en
    unsigned dds2_op : 1;		//dds2 freq en
REG_DEF_E_2

REG_DEF_S_2(0x007a,0x207a)
    unsigned freq : 32;			//dds1 freq,32L
REG_DEF_E_2

REG_DEF_S_2(0x00e9,0x20e9)
    unsigned freq : 32;			//dds1 freq,32H
REG_DEF_E_2

