Andydingbing/SPC5/include/RegDef.h
REG_DEF_S_2(0x00ea,0x20ea)
    unsigned freq : 32;			//dds2 freq,32L
REG_DEF_E_2

REG_DEF_S_2(0x00eb,0x20eb)
    unsigned freq : 32;			//dds2 freq,32H
REG_DEF_E_2

REG_DEF_S_2(0x007b,0x207b)
    unsigned op : 1;			//duc en
REG_DEF_E_2

REG_DEF_S_2(0x007c,0x207c)
    unsigned duc : 32;			//duc freq,32L
REG_DEF_E_2

REG_DEF_S_2(0x00e8,0x20e8)
    unsigned duc : 32;			//duc freq,32H
REG_DEF_E_2

REG_DEF_S_2(0x007d,0x207d)
    unsigned op : 1;			//ddc en
REG_DEF_E_2

REG_DEF_S_2(0x007e,0x207e)
    unsigned ddc : 32;			//ddc freq,32L
REG_DEF_E_2

REG_DEF_S_2(0x00e7,0x20e7)
    unsigned ddc : 32;			//ddc freq,32H
REG_DEF_E_2

REG_DEF_S_2(0x0085,0x2085)
    unsigned dds1_amp : 16;		//dds1 amplitude
    unsigned dds2_amp : 16;		//dds2 amplitude
REG_DEF_E_2

REG_DEF_S_2(0x0094,0x2094)		//tx power compensate
    unsigned i : 16;
    unsigned q : 16;
REG_DEF_E_2

REG_DEF_S_2(0x00b9,0x20b9)
    unsigned iq_avg : 32;		//rx power(dc)
REG_DEF_E_2

REG_DEF_S_2(0x00e4,0x20e4)
    unsigned ratio : 16;		//rx power compensate
REG_DEF_E_2

REG_DEF_S_2(0x00e5,0x20e5)
    unsigned op : 1;			//get rx power(dc) en
    unsigned busy : 1;			//get rx power(dc) busy
REG_DEF_E_2

REG_DEF_S_2(0x00e6,0x20e6)		//sync set tx gain
    unsigned op_0 : 4;
    unsigned op_1 : 4;
REG_DEF_E_2

REG_DEF_S_2(0x00ec,0x20ec)
    unsigned op  : 1;			//tx 2 interpolation fir filter each coef en
    unsigned rsv : 31;
REG_DEF_E_2

REG_DEF_S_2(0x00ed,0x20ed)
    unsigned addr : 16;			//tx 2 interpolation fir filter each coef address
    unsigned rsv  : 16;
REG_DEF_E_2

REG_DEF_S_2(0x00ee,0x20ee)
    unsigned sum : 16;                  //tx 2 interpolation fir filter each coef real + imag
    unsigned rsv : 16;
REG_DEF_E_2

REG_DEF_S_2(0x00ef,0x20ef)
    unsigned real : 16;			//tx 2 interpolation fir filter each coef real
    unsigned rsv  : 16;
REG_DEF_E_2

REG_DEF_S_2(0x00f0,0x20f0)
    unsigned imag : 16;			//tx 2 interpolation fir filter each coef imag
    unsigned rsv  : 16;
REG_DEF_E_2

REG_DEF_S_2(0x00f1,0x20f1)
    unsigned op  : 1;			//tx 2 interpolation fir filter coef to ram en
    unsigned rsv : 31;
REG_DEF_E_2

REG_DEF_S_2(0x00f2,0x20f2)
    unsigned op  : 1;			//rx 3 decimation fir filter each coef en
    unsigned rsv : 31;
REG_DEF_E_2

REG_DEF_S_2(0x00f3,0x20f3)
    unsigned addr : 16;			//rx 3 decimation fir filter each coef address
    unsigned rsv  : 16;
REG_DEF_E_2

REG_DEF_S_2(0x00f4,0x20f4)
    unsigned sum : 16;			//rx 3 decimation fir filter each coef real + imag
    unsigned rsv : 16;
REG_DEF_E_2

REG_DEF_S_2(0x00f5,0x20f5)
    unsigned real : 16;			//rx 3 decimation fir filter each coef real
    unsigned rsv  : 16;
REG_DEF_E_2

REG_DEF_S_2(0x00f6,0x20f6)
    unsigned imag : 16;			//rx 3 decimation fir filter each coef imag
    unsigned rsv  : 16;
REG_DEF_E_2

REG_DEF_S_2(0x00f7,0x20f7)
    unsigned op  : 1;			//rx 3 decimation fir filter coef to ram en
    unsigned rsv : 31;
REG_DEF_E_2

REG_DEF_S_2(0x00f8,0x20f8)
    unsigned filter : 1;		//rx fir filter select : 0:3d;1:2i3d
REG_DEF_E_2

REG_DEF_S_2(0x00f9,0x20f9)
    unsigned filter : 1;		//rx fir filter select : 0:2i3d;1:3d	//reserved
REG_DEF_E_2

REG_DEF_S_2(0x00fa,0x20fa)
    unsigned en : 1;			//tx filter en
REG_DEF_E_2

REG_DEF_S_2(0x00ff,0x20ff)		//tx & rx fir filter truncation digit,both default 14(0xe)
    unsigned digit_tx : 4;
    unsigned rsv      : 12;
    unsigned digit_rx : 4;
    unsigned rsv2     : 12;
REG_DEF_E_2

REG_DEF_S_2(0x0502,0x0602)
    unsigned repetition : 1;		//
    unsigned cycles     : 12;
    unsigned rsv	: 2;
    unsigned addition   : 17;
REG_DEF_E_2

REG_DEF_S_2(0x0503,0x0603)
    unsigned adr : 5;
    unsigned seg : 6;
    unsigned rsv : 20;
    unsigned op  : 1;
REG_DEF_E_2

REG_DEF_S_2(0x0504,0x0604)
    unsigned data : 32;
REG_DEF_E_2

REG_DEF_S_2(0x0505,0x0605)
    unsigned seg : 7;
    unsigned rsv : 25;
REG_DEF_E_2

REG_DEF_S_2(0x0506,0x0606)
    unsigned samples : 31;
    unsigned rsv     : 1;
REG_DEF_E_2

REG_DEF_S_2(0x0507,0x0607)
    unsigned adr : 32;
REG_DEF_E_2

REG_DEF_S_2(0x0508,0x0608)
    unsigned comp : 1;
    unsigned rsv  : 7;
    unsigned arb  : 1;
    unsigned rsv2 : 23;
REG_DEF_E_2

REG_DEF_S_2(0x0509,0x0609)
    unsigned apc	: 1;
    unsigned rsv	: 7;
    unsigned en		: 1;
    unsigned rsv2	: 22;
    unsigned abort  : 1;
REG_DEF_E_2

REG_DEF_S_2(0x050a,0x060a)
    unsigned delay      : 27;
    unsigned src        : 3;
    unsigned autostart  : 1;
    unsigned retrig     : 1;
REG_DEF_E_2

REG_DEF_S_2(0x050b,0x060b)
    unsigned rsv  : 1;
    unsigned op	  : 1;
    unsigned rsv2 : 30;
REG_DEF_E_2

REG_DEF_S_2(0x050c,0x060c)
    unsigned ms_rm   : 2;
    unsigned ms_trig : 2;
    unsigned rsv     : 28;
REG_DEF_E_2

REG_DEF_S_2(0x050d,0x060d)
    unsigned next_seg : 6;
    unsigned rsv      : 25;
    unsigned op       : 1;
REG_DEF_E_2

REG_DEF_S_2(0x050e,0x060e)
    unsigned seg : 6;
    unsigned rsv : 26;
REG_DEF_E_2

REG_DEF_S_2(0x0510,0x0610)
    unsigned op  : 1;
    unsigned rsv : 31;
REG_DEF_E_2

REG_DEF_S_2(0x0511,0x0611)
    unsigned offset : 32;
REG_DEF_E_2

REG_DEF_S_2(0x0533,0x0633)		//marker1
    unsigned adr : 10;
    unsigned rsv : 21;
    unsigned op  : 1;
REG_DEF_E_2

REG_DEF_S_2(0x0534,0x0634)
    unsigned data : 32;
REG_DEF_E_2

REG_DEF_S_2(0x0535,0x0635)		//marker2
    unsigned adr : 10;
    unsigned rsv : 21;
    unsigned op  : 1;
REG_DEF_E_2

REG_DEF_S_2(0x0536,0x0636)
    unsigned data : 32;
REG_DEF_E_2

REG_DEF_S_2(0x0537,0x0637)		//marker3
    unsigned adr : 10;
    unsigned rsv : 21;
    unsigned op  : 1;
REG_DEF_E_2

REG_DEF_S_2(0x0538,0x0638)
    unsigned data : 32;
REG_DEF_E_2

REG_DEF_S_2(0x0539,0x0639)		//marker4
    unsigned adr : 10;
    unsigned rsv : 21;
    unsigned op  : 1;
REG_DEF_E_2

REG_DEF_S_2(0x053a,0x063a)
    unsigned data : 32;
REG_DEF_E_2

REG_DEF_S_2(0x053d,0x063d)
    unsigned delay2 : 16;
    unsigned delayr : 16;
REG_DEF_E_2

REG_DEF_S_2(0x053e,0x063e)
    unsigned delay4 : 16;
    unsigned delay3 : 16;
REG_DEF_E_2

REG_DEF_S_2(0x0540,0x0640)
    unsigned sample : 32;
REG_DEF_E_2

REG_DEF_S_2(0x0541,0x0641)
    unsigned cycle : 12;
    unsigned rsv   : 20;
REG_DEF_E_2

REG_DEF_S_2(0x0542,0x0642)
    unsigned time_h : 32;
REG_DEF_E_2

REG_DEF_S_2(0x0543,0x0643)
    unsigned time_l : 32;
REG_DEF_E_2

