Andydingbing/SPC5/include/RegDef.h
REG_DEF_S_2(0x1062,0x1092)
    unsigned iqcap_src_sel  :6;		//rx power meas source
    unsigned iqcap_src_edge :1;		//rx power meas edge
REG_DEF_E_2

REG_DEF_S_2(0x1063,0x1093)
    unsigned iqcap_timeout : 31;	//rx power meas timeout time(1/62.5e6 s)
    unsigned iqcap_tmo	   : 1;		//rx power meas timeout result(1:timeout)
REG_DEF_E_2

REG_DEF_S_2(0x1064,0x1094)
    unsigned op : 1;			//rx power meas en
REG_DEF_E_2

REG_DEF_S_2(0x1065,0x1095)
    unsigned abort : 1;			//rx power meas abort
REG_DEF_E_2

REG_DEF_S_2(0x1066,0x1096)
    unsigned samples : 32;		//rx power meas samples
REG_DEF_E_2

REG_DEF_S_2(0x1067,0x1097)
    unsigned gap : 32;			//rx power meas gap
REG_DEF_E_2

REG_DEF_S_2(0x1068,0x1098)
    unsigned threshold : 32;		//rx power meas threshold
REG_DEF_E_2

REG_DEF_S_2(0x1069,0x1099)
    unsigned rsv : 23;
    unsigned op  : 1;			//rx 2i3d fir filter en		//reserved
REG_DEF_E_2

REG_DEF_S_2(0x106c,0x109c)		//rx 2i3d fir filter paramter	//reserved
    unsigned real  : 16;
    unsigned addr  : 8;
    unsigned rev   : 4;
    unsigned group : 3;
    unsigned op    : 1;
REG_DEF_E_2

REG_DEF_S_2(0x1074,0x10a4)		//rx power meas state machine
    unsigned state : 5;			//idle;waiting for trigger;trigger timeout;running;done
REG_DEF_E_2

REG_DEF_S_2(0x1075,0x10a5)
    unsigned iq_sum : 32;		//rx power meas power peak
REG_DEF_E_2

REG_DEF_S_2(0x1076,0x10a6)
    unsigned iq_sum_h : 32;		//rx power meas power iq 32H
REG_DEF_E_2

REG_DEF_S_2(0x1077,0x10a7)
    unsigned iq_sum_l : 32;		//rx power meas power iq 32L
REG_DEF_E_2

REG_DEF_S_2(0x1080,0x10b0)
    unsigned imag : 16;			//rx 2i3d fir filter coef imag		//reserved
    unsigned rsv  : 16;
REG_DEF_E_2

REG_DEF_S_2(0x10c0,0x10f0)
    unsigned iqcap_trig_offset :32;	//no list iq cap trigger offset
REG_DEF_E_2

REG_DEF_S_2(0x10c1,0x10f1)
    unsigned iqcap_cap_offset : 32;	//no list iq cap cap offset
REG_DEF_E_2

REG_DEF_S_2(0x10c2,0x10f2)
    unsigned iqcap_src_sel  :6;		//
    unsigned iqcap_src_edge :1;
REG_DEF_E_2

REG_DEF_S_2(0x10c3,0x10f3)
    unsigned iqcap_timeout : 31;	//
    unsigned iqcap_tmo	   : 1;
REG_DEF_E_2

REG_DEF_S(0x10c4)
    unsigned op : 1;			//iq cap start
REG_DEF_E

REG_DEF_S(0x10c5)
    unsigned abort : 1;			//iq cap abort
REG_DEF_E

REG_DEF_S(0x10c6)
    unsigned samples : 32;		//iq cap total samples(ch0 + ch1)
REG_DEF_E

REG_DEF_S_2(0x10c7,0x10f7)
    unsigned gap : 32;			//iq cap trigger gap
REG_DEF_E_2

REG_DEF_S_2(0x10c8,0x10f8)
    unsigned threshold : 32;		//
REG_DEF_E_2

REG_DEF_S(0x10cf)
    unsigned cap_tlp_count : 16;	//iq cap tlp count
REG_DEF_E

REG_DEF_S_2(0x1601,0x1681)
    unsigned op   : 1;			//r1a/b rx lo1 spi write en
    unsigned busy : 1;
REG_DEF_E_2

REG_DEF_S_2(0x1602,0x1682)
    unsigned data : 32;			//r1a/b rx lo1 spi data
REG_DEF_E_2

REG_DEF_S_2(0x1603,0x1683)
    unsigned muxout : 1;		//r1a/b rx lo1 muxout
REG_DEF_E_2

REG_DEF_S_2(0x1605,0x1685)
    unsigned op   : 1;			//r1a/b rx lo2 spi write en
    unsigned busy : 1;
REG_DEF_E_2

REG_DEF_S_2(0x1606,0x1686)
    unsigned data : 32;			//r1a/b rx lo2 spi data
REG_DEF_E_2

REG_DEF_S_2(0x1607,0x1687)
    unsigned muxout : 1;		//r1a/b rx lo2 muxout
REG_DEF_E_2

REG_DEF_S_2(0x1609,0x1689)
    unsigned op   : 1;			//r1a/b tx lo1 spi write en
    unsigned busy : 1;
REG_DEF_E_2

REG_DEF_S_2(0x160a,0x168a)
    unsigned data : 32;			//r1a/b tx lo1 spi data
REG_DEF_E_2

REG_DEF_S_2(0x160b,0x168b)
    unsigned muxout : 1;		//r1a/b tx lo1 muxout
REG_DEF_E_2

REG_DEF_S_2(0x160d,0x168d)
    unsigned op   : 1;			//r1a/b tx lo2 spi write en
    unsigned busy : 1;
REG_DEF_E_2

REG_DEF_S_2(0x160e,0x168e)
    unsigned data : 32;			//r1a/b tx lo2 spi data
REG_DEF_E_2

REG_DEF_S_2(0x160f,0x168f)
    unsigned muxout : 1;		//r1a/b tx lo2 muxout
REG_DEF_E_2

REG_DEF_S_2(0x1611,0x1691)
    unsigned op : 1;			//r1a/b ad7680 en
    unsigned busy : 1;			//r1a/b ad7680 bus state
    unsigned rsv : 14;
REG_DEF_E_2

REG_DEF_S_2(0x1612,0x1692)
    unsigned adc : 32;			//r1a/b ad7680 value
REG_DEF_E_2

REG_DEF_S_2(0x1615,0x1695)
    unsigned tmp : 32;			//r1a/b rx temp
REG_DEF_E_2

REG_DEF_S_2(0x1618,0x1698)
    unsigned tmp : 32;			//r1a/b tx temp
REG_DEF_E_2

REG_DEF_S_2(0x161d,0x169d)
unsigned op : 1;			//r1a/b/c/d at24c256b(eeprom) spi write en
unsigned mode : 1;			//0:write 1:read
REG_DEF_E_2

REG_DEF_S_2(0x161e,0x169e)
    unsigned addr : 16;			//r1a/b/c/d eeprom address
REG_DEF_E_2

REG_DEF_S_2(0x161f,0x169f)
    unsigned wr_data : 8;		//r1a/b/c/d eeprom write mode write data
REG_DEF_E_2

REG_DEF_S_2(0x1620,0x16a0)
    unsigned rd_data : 8;		//r1a/b/c/d eeprom read mode read data
REG_DEF_E_2

REG_DEF_S_2(0x163d,0x16bd)
    unsigned op   : 1;			//r1a/b ltc2666 spi write en
    unsigned busy : 1;			//r1a/b ltc2666 spi bus state
REG_DEF_E_2

REG_DEF_S_2(0x163f,0x16bf)		//r1a/b ltc2666 spi write data
    unsigned data_word    : 16;
    unsigned address_word : 4;
    unsigned command_word : 4;
    unsigned dont_care    : 8;
REG_DEF_E_2

REG_DEF_S_2(0x1640,0x16c0)		//r1a/b ltc2666 spi read data
    unsigned data_word    : 16;
    unsigned address_word : 4;
    unsigned command_word : 4;
    unsigned dont_care    : 8;
REG_DEF_E_2

REG_DEF_S_2(0x1641,0x16c1)
    unsigned op   : 1;			//r1a/b rx att1 spi write en
    unsigned busy : 1;			//r1a/b rx att1 spi bus state
REG_DEF_E_2

REG_DEF_S_2(0x1642,0x16c2)
    unsigned data_word : 6;		//r1a/b rx att1 spi write data
REG_DEF_E_2

REG_DEF_S_2(0x1660,0x16e0)
    unsigned pow_en	: 1;		//r1a/b tx power sw(0:off 1:on)
REG_DEF_E_2

REG_DEF_S_2(0x1661,0x16e1)
    unsigned det_sw : 1;		//r1a/b ad7680 sw(0:tx 1:rx)
REG_DEF_E_2

REG_DEF_S_2(0x1662,0x16e2)
    unsigned mod_en : 1;		//r1a/b tx adl5375 mod en
REG_DEF_E_2

REG_DEF_S_2(0x1663,0x16e3)
    unsigned band_sw : 1;		//r1a/b tx band sw
    unsigned q : 1;			//r1a/b q reverse
REG_DEF_E_2

