Andydingbing/SPC5/include/RegDef.h
REG_DEF_S_2(0x1664,0x16e4)		//r1a/b tx att1/2/3
    unsigned tx_att3_c1 : 1;
    unsigned tx_att3_c2 : 1;
    unsigned tx_att1_c1 : 1;
    unsigned tx_att1_c2 : 1;
    unsigned tx_att2_c2 : 1;
    unsigned tx_att2_c1 : 1;
REG_DEF_E_2

REG_DEF_S_2(0x1665,0x16e5)
    unsigned att_pa_sw : 1;		//r1a/b tx pa/att sw
REG_DEF_E_2

REG_DEF_S_2(0x1666,0x16e6)		//r1a/b io sw
    unsigned rx_io_sw1	 : 1;
    unsigned rx_io_sw2	 : 1;
    unsigned rx_io_sw	 : 2;
    unsigned tx_io_sw	 : 2;
REG_DEF_E_2

REG_DEF_S_2(0x1667,0x16e7)		//r1a/b io led sw(0:off 1:on)
    unsigned tx_led : 1;
    unsigned rx_led : 1;
REG_DEF_E_2

REG_DEF_S_2(0x1668,0x16e8)
    unsigned fil_sw : 1;		//r1a/b/c/d rx if filter sw(0:100MHz 1:160MHz)
REG_DEF_E_2

REG_DEF_S_2(0x1669,0x16e9)              //r1a/b rx att2
    unsigned rx_att2_c1 : 1;
    unsigned rx_att2_c2 : 1;
REG_DEF_E_2

REG_DEF_S_2(0x166a,0x16ea)
    unsigned lna_att_sw : 1;		//r1a/b rx lna/att sw(0:att 1:lna)
REG_DEF_E_2

REG_DEF_S(0x1670)
    unsigned data : 32;			//reserved
REG_DEF_E

REG_DEF_S_2(0x1804,0x2804)		//r1c/d hmc1197 spi open mode
    unsigned op   : 1;
    unsigned wr   : 1;
    unsigned busy : 1;
    unsigned rsv  : 1;
    unsigned mod  : 1;
REG_DEF_E_2

REG_DEF_S_2(0x1805,0x2805)
    unsigned data : 32;			//r1c/d hmc1197 spi open mode write data
REG_DEF_E_2

REG_DEF_S_2(0x1807,0x2807)
    unsigned data : 32;			//r1c/d hmc1197 spi open mode read data
REG_DEF_E_2

REG_DEF_S_2(0x1810,0x2810)
    unsigned op   : 1;			//r1c/d tx att0 spi write en
    unsigned busy : 1;			//r1c/d tx att0 spi bus state
REG_DEF_E_2

REG_DEF_S_2(0x1811,0x2811)
    unsigned data_word : 6;		//r1c/d tx att0 spi write data
REG_DEF_E_2

REG_DEF_S_2(0x1814,0x2814)
    unsigned op   : 1;			//r1c/d tx att1 spi write en
    unsigned busy : 1;			//r1c/d tx att1 spi bus state
REG_DEF_E_2

REG_DEF_S_2(0x1815,0x2815)
    unsigned data_word : 6;		//r1c/d tx att1 spi write data
REG_DEF_E_2

REG_DEF_S_2(0x1818,0x2818)
    unsigned op   : 1;			//r1c/d tx att2 spi write en
    unsigned busy : 1;			//r1c/d tx att2 spi bus state
REG_DEF_E_2

REG_DEF_S_2(0x1819,0x2819)
    unsigned data_word : 6;		//r1c/d tx att2 spi write data
REG_DEF_E_2

REG_DEF_S_2(0x181c,0x281c)
    unsigned op   : 1;			//r1c/d tx att3 spi write en
    unsigned busy : 1;			//r1c/d tx att3 spi bus state
REG_DEF_E_2

REG_DEF_S_2(0x181d,0x281d)
    unsigned data_word : 6;		//r1c/d tx att3 spi write data
REG_DEF_E_2

REG_DEF_S_2(0x1820,0x2820)
    unsigned op   : 1;			//r1c/d rx att1 spi write en
    unsigned busy : 1;			//r1c/d rx att1 spi bus state
REG_DEF_E_2

REG_DEF_S_2(0x1821,0x2821)
    unsigned data_word : 6;		//r1c/d rx att1 spi write data
REG_DEF_E_2

REG_DEF_S_2(0x1824,0x2824)
    unsigned op   : 1;			//r1c/d rx att2 spi write en
    unsigned busy : 1;			//r1c/d rx att2 spi bus state
REG_DEF_E_2

REG_DEF_S_2(0x1825,0x2825)
    unsigned data_word : 6;		//r1c/d rx att2 spi write data
REG_DEF_E_2

REG_DEF_S_2(0x1827,0x2827)
    unsigned sw : 1;			//r1c/d rx power det if1/if2 sw
REG_DEF_E_2

REG_DEF_S_2(0x1828,0x2828)
    unsigned filter : 1;		//r1c/d tx filter sw
REG_DEF_E_2

REG_DEF_S_2(0x1829,0x2829)
    unsigned pow_en	: 1;		//r1c/d tx power sw(0:off 1:on)
REG_DEF_E_2

REG_DEF_S_2(0x182b,0x282b)
    unsigned op   : 1;			//r1c/d rx att3 spi write en
    unsigned busy : 1;			//r1c/d rx att3 spi bus state
REG_DEF_E_2

REG_DEF_S_2(0x182c,0x282c)
    unsigned data_word : 6;		//r1c/d rx att3 spi write data
REG_DEF_E_2

REG_DEF_S_2(0x182d,0x282d)		//r1c/d io ext
    unsigned addr : 8;
    unsigned wr	  : 1;
    unsigned op	  : 1;
    unsigned busy : 1;
REG_DEF_E_2

REG_DEF_S_2(0x182e,0x282e)
    unsigned data : 8;			//r1c/d io ext spi write data
REG_DEF_E_2

REG_DEF_S_2(0x182f,0x282f)
    unsigned data : 8;			//r1c/d io ext spi read data
REG_DEF_E_2

REG_DEF_S_2(0x1832,0x2832)		//r1c/d 3208
    unsigned addr : 3;
    unsigned op   : 1;
    unsigned rsv  : 4;
    unsigned busy : 1;
REG_DEF_E_2

REG_DEF_S_2(0x1833,0x2833)
    unsigned ad : 12;			//r1c/d 3208 spi read data
REG_DEF_E_2

REG_DEF_S_2(0x1835,0x2835)
    unsigned filter : 1;                //r1d tx lo2 filter sw
REG_DEF_E_2

REG_DEF_S_2(0x1836,0x2836)		//r1c/d hmc1197 spi hmc mode
    unsigned addr : 8;
    unsigned wr	  : 1;
    unsigned op	  : 1;
    unsigned busy : 1;
REG_DEF_E_2

REG_DEF_S_2(0x1837,0x2837)
    unsigned data : 24;			//r1c/d hmc1197 spi hmc mode write data
REG_DEF_E_2

REG_DEF_S_2(0x1838,0x2838)
    unsigned data : 24;			//r1c/d hmc1197 spi hmc mode read data
REG_DEF_E_2

}

//rfu s6
namespace ns_reg_rfu_s6 {

REG_DEF_S(0x0000)
    unsigned ver : 32;			//firmware ver
REG_DEF_E

REG_DEF_S(0x0001)
    unsigned op : 1;			//CDCE62005 reconfig
REG_DEF_E

REG_DEF_S_2(0x0002,0x0006)
    unsigned PROGRAM_B : 1;
REG_DEF_E_2

REG_DEF_S_2(0x0003,0x0007)		//program bit state
    unsigned pc_cfg_init    : 1;
    unsigned c_cfg_done	    : 1;
    unsigned fifo_prog_full : 1;	//fifo full flag£¬0:full
    unsigned fifo_wr_en     : 1;	//fifo write en
REG_DEF_E_2

REG_DEF_S_2(0x0004,0x0008)
    unsigned load_mode : 1;		//0:master spi mode,1:slave select map
REG_DEF_E_2

REG_DEF_S_2(0x0005,0x0009)
    unsigned buf : 32;			//program bit data
REG_DEF_E_2

REG_DEF_S(0x000a)			//ad sw rf/if
    unsigned rf_ch_3	: 1;
    unsigned reserved_3 : 3;
    unsigned rf_ch_2	: 1;
    unsigned reserved_2 : 3;
    unsigned rf_ch_1	: 1;
    unsigned reserved_1 : 3;
    unsigned rf_ch_0	: 1;
    unsigned reserved_0 : 3;
REG_DEF_E

REG_DEF_S(0x000b)			//da sw rf/if
    unsigned rf_ch_3	: 1;
    unsigned reserved_3 : 3;
    unsigned rf_ch_2	: 1;
    unsigned reserved_2 : 3;
    unsigned rf_ch_1	: 1;
    unsigned reserved_1 : 3;
    unsigned rf_ch_0	: 1;
    unsigned reserved_0 : 3;
    unsigned rst	: 1;            //da reset
REG_DEF_E

}

//cxu s6
namespace ns_reg_cxu_s6 {

REG_DEF_S(0x0000)
    unsigned ver : 32;			//firmware ver
REG_DEF_E

REG_DEF_S(0x000e)
    unsigned op : 1;
REG_DEF_E

REG_DEF_S(0x000f)
    unsigned val : 10;			//9119 voltage
    unsigned sign : 1;
REG_DEF_E

REG_DEF_S(0x0012)
    unsigned speed  : 8;		//blower speed
    unsigned addr   : 8;		//address
    unsigned op     : 1;		//blower en
    unsigned blower : 1;		//blower select
REG_DEF_E

REG_DEF_S(0x0013)
    unsigned speed  : 8;		//blower speed
    unsigned addr   : 8;		//address
    unsigned op     : 1;		//blower en
    unsigned blower : 1;		//blower select
REG_DEF_E

}

using namespace ns_reg_rfu_k7;
using namespace ns_reg_rfu_s6;
using namespace ns_reg_cxu_s6;

#endif
